import { Roles } from "@/libs/enums/app/Role";

export const roleCardData = [
  {
    id: 1,
    role: Roles.JUNIOR,
    title: "Junior",
    properties: [
      { id: 1, text: "пет-проєкти, комерційні проєкти, стартапи" },
      { id: 2, text: "вакансії для джуніорів/ стажування/ фріланс" },
      { id: 3, text: "конструктор резюме та супровідного листа" },
      { id: 4, text: "підтримка та наставництво Менторів" },
      { id: 5, text: "навчальні матеріали, бібліотека" },
      { id: 6, text: "участь в професійних вебінарах, конференціях" },
      { id: 7, text: "комунікація з однодумцями в чаті" },
      { id: 8, text: "корисні блоги та форуми" },
    ],
  },

  {
    id: 2,
    role: Roles.MENTOR,
    title: "Mentor",
    properties: [
      { id: 1, text: "участь в проєктах у ролі Ментора" },
      {
        id: 2,
        text: "відстеження прогресу учнів та надання зворотного зв’язку",
      },
      { id: 3, text: "комунікація в чаті з іншими Менторами" },
      { id: 4, text: "доступ до актуальних навчальних матеріалів" },
      { id: 5, text: "рейтинг Менторства" },
      {
        id: 6,
        text: "організація та участь у професійних вебінарах і конференціях",
      },
      { id: 7, text: "участь у форумах та спільнотах" },
      { id: 8, text: "просування стартапів" },
      { id: 9, text: "написання статей у блозі" },
    ],
  },
  {
    id: 3,
    role: Roles.INVESTOR,
    title: "Investor",
    properties: [
      { id: 1, text: "унікальні проєкти з високим потенціалом" },
      { id: 2, text: "підбір стартапів" },
      { id: 3, text: "фінансові звіти, бізнес-плани та стратегії розвитку" },
      { id: 4, text: "прозоре звітування" },
      {
        id: 5,
        text: "події, конференції присвячені технологіям та інноваціям",
      },
      { id: 6, text: "зручна комунікація в чаті" },
    ],
  },

  {
    id: 4,
    role: Roles.PARTNER,
    title: "Partner",
    properties: [
      { id: 1, text: "співпраця з надання власних послуг (освіта, реклама)" },
      { id: 2, text: "доступ до талановитих спеціалістів" },
      { id: 3, text: "замовлення комерційних проєктів" },
      { id: 4, text: "пропозиції для роботодавців, рекрутерів та HR-фахівців" },
      { id: 5, text: "інноваційні рішення та передові інструменти" },
    ],
  },
];
