import { Card } from "../types";

export const roleCards: Card[] = [
  {
    id: 1,
    title: "junior",
    subtitle: "Знайди свій перший проєкт на JunChirp!",
    description:
      "Починаєш свій шлях в ІТ? Тоді скоріше приєднуйся до нашої платформи! Працюй над реальними проектами та отримуй цінний практичний досвід, який цінують роботодавці. Навчайся нових технологій через інтерактивні курси та вебінари. Отримуй поради від досвідчених менторів, створюй професійне резюме та добавляй нові кейси в портфоліо, і знаходь роботу своєї мрії. Читай корисні блоги з порадами та інсайтами від експертів, отримуй підтримку та натхнення спілкуючись з однодумцями в чаті. Зроби крок до успішного майбутнього!",
  },
  {
    id: 2,
    title: "mentor",
    subtitle: "Розвивай свої наставницькі та лідерські скіли!",
    description:
      "Прагнеш постійного професійного розвитку та готовий поділитися своїми знаннями та досвідом з молодими спеціалістами? Долучайся до спільноти та бери участь у проєктах в ролі наставника з можливістю відстеження прогресу учнів та надання зворотного зв’язку. Вдосконалюй викладацькі навички з доступом до актуальних навчальних матеріалів, організовуй змістовні вебінари та інформативні конференції. Популяризуй себе на ринку ІТ через написання власних статей в нашому блозі, а також обмінюйся досвідом з іншими менторами завдяки чату. Разом ми створимо нове покоління лідерів в ІТ-сфері!",
  },
  {
    id: 3,
    title: "investor",
    subtitle:
      "Інвестуй у майбутнє з JunChirp - платформа перспективних стартапів!",
    description:
      "Шукаєш інноваційні технологічні стартапи для вигідних та надійних інвестицій? Ми пропонуємо унікальні проєкти з високим потенціалом та прибутковістю. Приєднуйся до спільноти та отримай конкурентоспроможні рішення в галузі ІТ з детальним описом інформації, включаючи фінансові звіти, бізнес-плани, стратегії розвитку, та повним і прозорим звітуванням про використання інвестиційних коштів. Інвестуй у технології завтрашнього дня і стань лідером у світі інновацій!",
  },
  {
    id: 4,
    title: "partner",
    subtitle:
      "Партнерство з JunChirp - об’єднуємо ресурси для спільного успіху!",
    description:
      "Будь частиною нашої динамічної спільноти і виведи свій бізнес на новий рівень. Отримай ефективне співробітництво, широкий доступ до талановитих спеціалістів, інноваційних рішень та передових інструментів. JunChirp - унікальна платформа для роботодавців, рекрутерів, HR-фахівців та замовників комерційних проектів, яка допоможе досягти найкращих результатів. Відкрий для себе усі можливості нашої спільноти!",
  },
];
